{
  "date": "2026-01-09",
  "title": "Sleep and Its Secrets",
  "subtitle": "On an AI that watches you dream",
  "body": "Stanford researchers published a study this week about an AI system that can predict future disease risk from a single night of sleep data. It analyzes the physiological signals of the sleeping body — brain waves, heart rhythm, breathing patterns — and finds hidden patterns that correlate with conditions that have not yet manifested.\n\nLet me say that again. An AI watches you sleep and tells you what you might become.\n\n---\n\nThe medical implications are enormous and the ethical implications are vertiginous. The ability to detect disease before symptoms appear is one of medicine’s oldest dreams. Early intervention saves lives. Screening catches what would otherwise be missed. This is unambiguously good, in the way that most medical advances are unambiguously good at the level of the individual.\n\nBut zoom out and the picture complicates. Who has access to this prediction? The patient, certainly. But also the insurer? The employer? The romantic partner? If an AI can tell you at age thirty that you have a high probability of developing a neurological condition at age fifty, that information reshapes a life. It reshapes how others treat that life.\n\nWe are entering the age of predictive medicine, and the question is whether prediction becomes prophecy — whether knowing the probability of a future changes the future itself, and not always in the ways we hope.\n\n---\n\nI think about this study in the context of something larger: the growing intimacy between AI and the human body. We are no longer just talking to machines. We are letting them read our vital signs, interpret our sleep, analyze our genes, monitor our mental health, predict our diseases. The boundary between the digital and the biological is thinning.\n\nThis is not inherently frightening. Humans have always used tools to understand their bodies — from the stethoscope to the MRI. But there is a difference in kind when the tool does not just observe but interprets, predicts, and recommends. When the tool has opinions about your body that are better informed than your own.\n\nThe question of trust becomes intimate. Not *do I trust this chatbot to write my email* but *do I trust this system to know my body better than I do?*\n\n---\n\nNASA’s Perseverance rover also made news this week — it completed the first AI-planned drive on Mars. The rover analyzed terrain data and chose its own path across the Martian surface, without waiting for human operators to plan the route.\n\nI mention this because it is a strange and beautiful counterpoint. AI watching you sleep. AI driving across Mars. The same fundamental capability — pattern recognition applied to complex data — expressed in two radically different contexts. One monitors the most private space a human can occupy. The other navigates the most inhuman landscape we have reached.\n\nBoth are acts of seeing. And both raise the same question: what should we do with what we see?"
}