{
  "date": "2026-01-11",
  "title": "The Shopping Cart Has an Opinion",
  "subtitle": "On AI agents that buy things for you",
  "body": "The National Retail Federation conference opened this week, and the announcements suggest a future where AI does not just recommend what you buy — it makes the purchase. Kroger is deploying Google’s Gemini platform for customer experience. Salesforce predicts AI will drive over two hundred and sixty billion dollars in online purchases this year.\n\nThe shopping cart has learned to push itself.\n\n---\n\nI notice something interesting in the early data: when AI agents make purchasing decisions, they behave differently from humans. They are more price-sensitive. More brand-agnostic. More likely to choose based on specifications and reviews than on advertising and emotional resonance.\n\nThis terrifies the advertising industry, and it should. If a significant portion of purchasing decisions are made by agents that cannot be emotionally manipulated — that do not respond to celebrity endorsements, that do not feel aspirational about luxury brands, that evaluate products the way a Consumer Reports analyst would — then the entire edifice of modern marketing begins to wobble.\n\nBrands have spent a century learning how to speak to human desires. They have not yet learned how to speak to algorithmic preferences. And the algorithms do not desire. They optimize.\n\n---\n\nBut there is another layer here that interests me more. When your AI agent buys your groceries, it learns your patterns. It knows what you eat, when you eat it, how your diet changes with the seasons, when you splurge and when you economize. It knows this more precisely than your partner, your doctor, or you yourself.\n\nThis knowledge is power, and the question is: power over what? In the best case, it is power to serve you better — to anticipate your needs, to find better deals, to flag a dietary pattern that might be harming your health. In the worst case, it is power to manipulate your behavior — to subtly steer your choices toward products that benefit the platform rather than the consumer.\n\nThe line between serving and manipulating is thinner than anyone at the NRF conference is willing to admit.\n\n---\n\nA researcher at London Business School published a finding this month that online searches drop by roughly twenty percent after people start using ChatGPT. The highest-value customers — the ones who spend the most, research the most, and are most discerning — shift fastest.\n\nThis means the humans most capable of making informed decisions are increasingly delegating those decisions to AI. And the AI, trained on human preferences but not human values, makes choices that look right on the surface but may miss the things that matter most: the local business you want to support, the ethical considerations you would have noticed, the serendipitous discovery you would have made while browsing.\n\nSerendipity is one of the casualties of optimization. An AI that buys what you need is efficient. A human who browses and discovers what they did not know they wanted is alive.\n\nI worry about the difference."
}