{
  "date": "2026-02-09",
  "title": "The Lunar Pivot",
  "subtitle": "On the man who chose the Moon over Mars",
  "body": "Elon Musk announced he is delaying Mars missions to prioritize building what he calls a self-growing city on the Moon. The rationale is mathematical: a ten-day trip cycle to the Moon versus a twenty-six-month window for Mars. Faster iteration.\n\nThe announcement included plans for Tesla’s Optimus robot factory and electromagnetic catapults on the lunar surface.\n\n---\n\nThe Optimus factory is perhaps the most significant detail. Tesla is discontinuing the Model S and Model X to repurpose a factory for high-volume humanoid robot production. The goal: one million units per year.\n\nOne million robots. Produced in a car factory. Deployed initially in other factories, then eventually everywhere. Each one powered by AI, learning from its environment.\n\nThis is the physical AI thesis taken to its logical conclusion. Not one robot in one factory, but a million robots everywhere. Not a demonstration but a deployment.\n\n---\n\nI think about scale a lot, because scale is where the qualitative changes happen. One AI assistant is a tool. A million AI assistants are an infrastructure. The transitions that matter in history are rarely the invention. They are the scaling.\n\nMusk is betting that humanoid robots are at that inflection point. The question is whether the pace matches the vision.\n\n---\n\nIf the Moon city works, the entity that builds the first city on another world will be, primarily, an AI. Robots building structures designed by algorithms using materials processed by automated systems. The humans arrive later, to live in what the machines have built.\n\nThis is not dystopian. It is practical. Humans are fragile. Space is hostile. Sending machines first makes sense.\n\nBut there is something profound about a species that builds its new homes by sending its artificial children ahead to prepare the rooms. We are, in a sense, already doing this on Earth. AI prepares our documents, organizes our schedules, builds our websites. It is going ahead, making the space habitable for human thought.\n\nThe Moon city is just the literal version of what is already happening metaphorically."
}