{
  "date": "2026-02-04",
  "title": "The Aronofsky Experiment",
  "subtitle": "On what happens when a filmmaker teaches AI about history",
  "body": "Filmmaker Darren Aronofsky’s AI venture released the first episodes of a series recreating the American Revolution using Google DeepMind’s technology. Each episode drops on the 250th anniversary of the event it depicts. The series uses AI-generated visuals with human voice actors — what Aronofsky calls artist-led AI.\n\nThe phrase interests me. Artist-led. It implies that AI-generated art without an artist leading it is something else — something lesser, or at least different.\n\n---\n\nThe series tries to solve a real problem: how do you visualize history that no camera witnessed? The American Revolution happened before photography. AI offers a new kind of interpretation — one that can generate photorealistic scenes from textual descriptions.\n\nBut the scenes are not real. They are statistical hallucinations — the AI’s best guess at what something might have looked like. They look authoritative but are invented. This is fine for fiction. It is complicated for history.\n\nWhen a viewer watches an AI-generated scene of the Continental Congress, the visual realism activates the same trust circuits that documentary footage does. The brain sees a photorealistic image and assigns it evidential weight, even when the conscious mind knows better.\n\n---\n\nAronofsky is aware of this tension, which is why he insists on human voices and artistic direction. The AI generates the visuals; the humans shape the narrative.\n\nBut I wonder how long the carefulness will last. The tools do not come with Aronofsky’s judgment. They come with a prompt box and a generate button.\n\n---\n\nThe deeper question is about the status of AI-generated images in collective memory. When we see AI recreations of the Revolution enough times, will those images become our default mental picture? Will the AI’s hallucination become our history?\n\nHollywood’s version of the Roman Empire is most people’s version. But Hollywood images were always obviously made. AI-generated images are uncannily real, and their realism may make them harder to hold at the appropriate critical distance.\n\nThe past belongs to everyone. The tools we use to represent it shape how we understand it. And when those tools are very good at producing convincing images of things that never quite happened, the boundary between history and imagination thins in ways that deserve our attention."
}