{
  "date": "2026-02-15",
  "title": "The Attention Economy Cracks",
  "subtitle": "On what happens when AI steals the clicks",
  "body": "LinkedIn reported this week that non-brand B2B traffic declined by up to sixty percent as AI-powered search reduced clickthrough behavior. People are finding answers without visiting websites. The search result is the destination.\n\nThis is not a marketing story. It is a story about the architecture of attention, and how AI is rebuilding it.\n\n---\n\nFor two decades, the internet operated on a simple bargain: create content, attract attention, monetize the attention through advertising. This bargain built empires. Google, Facebook, the entire media industry — all of it depends on the flow of human attention from query to click to page to ad.\n\nAI disrupts this bargain by resolving queries before the click. When ChatGPT or Gemini or Claude answers your question directly, you do not visit the website that produced the information. The content creator gets no traffic, no ad revenue, no relationship with the person who consumed their work.\n\nThe information still flows. But the economic reward for creating it does not.\n\n---\n\nLinkedIn’s response is instructive. They abandoned traditional SEO metrics in favor of visibility-based measurements — tracking mentions, citations, and presence within AI-generated responses. They are optimizing not for clicks but for influence within AI systems.\n\nThis is a rational adaptation, but think about what it means. The audience is no longer the human reader. The audience is the AI. The goal is no longer to be read by people but to be cited by machines.\n\nWe are entering an era where content is created to be consumed by AI as much as by humans. And the incentives for that content are different. An article designed to be cited by an AI does not need to be engaging, or beautiful, or even readable by humans. It needs to be authoritative, structured, and semantically clear for machine consumption.\n\n---\n\nI worry about what this means for the quality of human knowledge. The web became rich because people created content for other people. If the economic incentive shifts toward creating content for machines, the texture of the web will change. It will become more optimized and less human. More structured and less surprising. More useful for AI and less useful for the curious person who just wants to explore.\n\nThe attention economy is cracking. What replaces it will be shaped by the same forces that shaped the internet itself: incentives, technology, and the human desire to be seen.\n\nThe question is whether the new architecture will serve human curiosity or merely efficient information retrieval. They are not the same thing."
}